# GetElement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementIntersectsElementFilter..::..GetElement Method
ElementIntersectsElementFilter Class See Also
---
Gets the target element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Element GetElement()
```

Visual Basic
---
```text
Public Function GetElement As Element
```

Visual C++
---
```text
public:
Element^ GetElement()
```

# ### Return Value
The element.
# See Also
ElementIntersectsElementFilter Class
Autodesk.Revit.DB Namespace